list_of_dicts = [
    {
        'Волгоград': 4,
        'Воронеж': 2,
        'Екатеринбург': 2,
        'Иркутск': 5,
        'Махачкала': 1,
        'Новокузнецк': 4,
        'Омск': 1,
        'Ростов-на-Дону': 6,
        'Санкт-Петербург': 3,
        'Челябинск': 6
    },
    {
        'Иркутск': 4, 
        'Новокузнецк': 9, 
        'Омск': 6, 
        'Ульяновск': 9, 
        'Челябинск': 6
    },
    {
        'Екатеринбург': 4,
        'Ижевск': 3,
        'Новокузнецк': 3,
        'Новосибирск': 1,
        'Омск': 4,
        'Ростов-на-Дону': 8,
        'Самара': 3,
        'Тольятти': 3
    },
    {
        'Иркутск': 4,
        'Казань': 3,
        'Кемерово': 3,
        'Краснодар': 6,
        'Красноярск': 9,
        'Ростов-на-Дону': 1,
        'Санкт-Петербург': 8,
        'Тюмень': 3,
        'Ярославль': 9
    }
]