from utils import important_message

def main():
    # Получение сообщения от пользователя
    message = input("Введите ваше сообщение: ")
    # Вызов функции из другого модуля и вывод результата
    print("\n" + important_message(message=message) + "\n")

if __name__ == "__main__":
    main()

#Примеры ручного теста
##Введите ваше сообщение: ЗАГОЛОВОК ПРОГРАММЫ
##=====================================================================================================================#
##                                                                                                                     #
##                                                  ЗАГОЛОВОК ПРОГРАММЫ                                                #
##                                                                                                                     #
##=====================================================================================================================#

#Введите ваше сообщение: 'Обратите внимание на очень важное сообщение от команды разработчиков этой великолепной программы'

##=====================================================================================================================#
##                                                                                                                     #
##           'Обратите внимание на очень важное сообщение от команды разработчиков этой великолепной программы'        #
##                                                                                                                     #
##=====================================================================================================================#




   